<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest SnowSQL pkg from Snowflake's client repository by scraping the per-arch index page.
For Intel set DOWNLOAD_ARCH to "x86_64" (default)

For Apple Silicon set DOWNLOAD_ARCH to "arm64"</string>
	<key>Identifier</key>
	<string>com.github.jholt13-recipes.download.SnowSQL</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SnowSQL</string>
		<key>BASE_URL</key>
		<string>https://sfc-repo.snowflakecomputing.com/snowsql</string>
		<key>MAJOR_VERSION</key>
		<string>1.4</string>
		<key>DOWNLOAD_ARCH</key>
		<string>arm64</string>
  	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
	<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>%BASE_URL%/bootstrap/%MAJOR_VERSION%/darwin_%DOWNLOAD_ARCH%/index.html</string>
			<key>re_pattern</key>
			<string>(?s).*(snowsql\-(?P&lt;version&gt;\d+\.\d+\.\d+)\-darwin_%DOWNLOAD_ARCH%\.pkg)</string>
			<key>result_output_var_name</key>
			<string>FILENAME</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>%BASE_URL%/bootstrap/%MAJOR_VERSION%/darwin_%DOWNLOAD_ARCH%/%FILENAME%</string>
			<key>filename</key>
			<string>%NAME%-%version%.pkg</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>EndOfCheckPhase</string>
	</dict>
	</array>
</dict>
</plist>